app/controllers/guess_controller.rb

	def create
		if params[:guess][:accuracy] == "incorrect"
			@accuracy = Guess.new(:height => params[:guess][:height], :weight => params[:guess][:weight], :gender => params[:guess][:gender],:accuracy => false )
		else
			@accuracy = Guess.new(:height => params[:guess][:height], :weight => params[:guess][:weight], :gender => params[:guess][:gender],:accuracy => true )
		end

		@accuracy.save
---
INSERT INTO "guesses" ("accuracy", "created_at", "gender", "height", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["accuracy", "t"], ["created_at", "2015-02-05 02:57:04.713511"], ["gender", "female"], ["height", 60], ["updated_at", "2015-02-05 02:57:04.713511"], ["weight", 100]]